    .db $00, $00 ; llllbbbb, tttt???? l:ページ数 b:基本背景 t:タイル
    .db $00, $00 ; xxxxyyyy, pnnnnnnn x:x位置(0-F) y:y位置(0-D) p:改ページ n:種類
    .db $FF ; 終了


stageList:
    .dw $0000, stage1, stage2

stage1:
    .db $02 ; エリア数
    .db $01 ; 基本タイル
    .dw .area1, .area2
.area1:
    .db $06 ; ページ数
    .db $02, $02, $02, $02, $02, $02 ; 各ページのオブジェクト数

    .db $02, $B0 ; 種類(8), y位置(4)：x位置(4) 優先順位が小さいものから．
    .db $02, $BF

    .db $03, $B0
    .db $03, $BF

    .db $04, $B0
    .db $04, $BF

    .db $04, $B0
    .db $04, $BF

    .db $04, $B0
    .db $04, $BF

    .db $04, $B0
    .db $04, $BF
.area2:
    .db $02 ; ページ数
    .db $06, $04 ; 各ページのオブジェクト数

    .db $02, $00 ; 種類(8), y位置(4)：x位置(4) 優先順位が小さいものから．
    .db $02, $11
    .db $02, $22
    .db $02, $33
    .db $02, $44
    .db $02, $55

    .db $02, $00
    .db $02, $22
    .db $02, $44
    .db $02, $88

stage2:
    .db $02 ; エリア数
    .db $01 ; 基本タイル
    .dw .area1, .area2
.area1
    .db $02 ; ページ数
    .db $06, $04 ; 各ページのオブジェクト数

    .db $02, $00 ; 種類(8), y位置(4)：x位置(4) 優先順位が小さいものから．
    .db $02, $11
    .db $02, $22
    .db $02, $33
    .db $02, $44
    .db $02, $55

    .db $02, $00
    .db $02, $22
    .db $02, $44
    .db $02, $88
.area2
    .db $02 ; ページ数
    .db $06, $04 ; 各ページのオブジェクト数

    .db $02, $00 ; 種類(8), y位置(4)：x位置(4) 優先順位が小さいものから．
    .db $02, $11
    .db $02, $22
    .db $02, $33
    .db $02, $44
    .db $02, $55

    .db $02, $00
    .db $02, $22
    .db $02, $44
    .db $02, $88

baseTile:
    .db $10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$10
    .db $10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$10,$01,$01
    .db $01,$01,$01,$01,$01,$01,$01,$02,$02,$02,$02,$02,$02,$02
    .db $03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03,$03
    .db $04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04,$04

objectTileData:
    ; ブロック
    .db $00,$00,$00,$00
    .db $01,$01,$01,$01
    .db $60,$61,$62,$63
    .db $64,$65,$66,$67
    .db $68,$69,$6A,$6B
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    .db $00,$00,$00,$00
    ; 背景
    .db $00,$00,$00,$00

objectAttributeData:
    .db 0,1,2,3,1,2,3,0